{
  "plugins": {
    "auto-dark-mode.nvim": {
      "src": "https://github.com/f-person/auto-dark-mode.nvim",
      "version": "'e300259ec777a40b4b9e3c8e6ade203e78d15881'"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer",
      "version": "'b74fab3656eea9de20a9b8116afa3cfc4ec09657'"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp",
      "version": "'cbc7b02bb99fae35cb42f514762b89b5126651ef'"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path",
      "version": "'c642487086dbd9a93160e1679a1327be111cbc25'"
    },
    "harpoon": {
      "src": "https://github.com/ThePrimeagen/harpoon",
      "version": "'87b1a3506211538f460786c23f98ec63ad9af4e5'"
    },
    "lazydev.nvim": {
      "src": "https://github.com/folke/lazydev.nvim",
      "version": "1.10.0 - 1.10.0"
    },
    "lucid.nvim": {
      "src": "https://github.com/anttikivi/lucid.nvim",
      "version": "'b8dac7949c93a824e353bbd24f188b27ebdf8512'"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim",
      "version": "2.2.1 - 2.2.1"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp",
      "version": "'da88697d7f45d16852c6b2769dc52387d1ddc45f'"
    },
    "nvim-lint": {
      "src": "https://github.com/mfussenegger/nvim-lint",
      "version": "'386ca59429b0b033c45cff8efc0902445a1d6173'"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'81aca2f9815e26f638f697df1d828ca290847b64'"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim",
      "version": "2.15.0 - 2.15.0"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim",
      "version": "'b9fd5226c2f76c951fc8ed5923d85e4de065e509'"
    }
  }
}
