{
  "plugins": {
    "auto-dark-mode.nvim": {
      "src": "https://github.com/f-person/auto-dark-mode.nvim",
      "version": "'e300259ec777a40b4b9e3c8e6ade203e78d15881'"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer",
      "version": "'main'"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp",
      "version": "'main'"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path",
      "version": "'main'"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim",
      "version": "'master'"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim",
      "version": "'main'"
    },
    "harpoon": {
      "src": "https://github.com/ThePrimeagen/harpoon",
      "version": "'harpoon2'"
    },
    "lazydev.nvim": {
      "src": "https://github.com/folke/lazydev.nvim",
      "version": "'main'"
    },
    "lucid.nvim": {
      "src": "https://github.com/anttikivi/lucid.nvim",
      "version": "'b8dac7949c93a824e353bbd24f188b27ebdf8512'"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim",
      "version": "'main'"
    },
    "mini.icons": {
      "src": "https://github.com/nvim-mini/mini.icons",
      "version": "'main'"
    },
    "neovim": {
      "src": "https://github.com/rose-pine/neovim",
      "version": "'main'"
    },
    "nvim": {
      "src": "https://github.com/catppuccin/nvim",
      "version": "2.0.0 - 2.0.0"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp",
      "version": "'main'"
    },
    "nvim-lint": {
      "src": "https://github.com/mfussenegger/nvim-lint",
      "version": "'master'"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim",
      "version": "'master'"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim",
      "version": "'master'"
    },
    "telescope-fzf-native.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-fzf-native.nvim",
      "version": "'main'"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim",
      "version": "'master'"
    },
    "zig.vim": {
      "src": "https://codeberg.org/ziglang/zig.vim",
      "version": "'master'"
    }
  }
}
